note.org
#+INCLUDE: "../prefix.org"
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/mycustom.css"/>
#+HTML_HEAD: <script src="./js/jquery.min.js"></script>
#+HTML_HEAD: <script src="./js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="./js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="./js/readtheorg.js"></script>
#+TITLE: 欢迎来到我的博客
* busybox
|[[./2024-4-11/4607f8e230-RECD.html][busybox /bin/sh: can't access tty; job control turned off                       ]]|2024年04月11日|
* cc
|[[./2024-4-29/e1e3cddb89-RECD.html][文件同时可被bash和C使用                                                                  ]]|2024年04月29日|
|[[./2024-1-18/6d537c26fc-RECD.html][宏里面无法直接使用sizeof                                                                 ]]|2024年01月18日|
|[[./2024-1-16/31f55c452f-STDY.html][C语言别名 & 数组指针降级 & 宏#和##                                                          ]]|2024年01月16日|
* elisp
|[[./2024-4-24/fe01846929-RECD.html][auto-fill-mode可以设置每行字长                                                          ]]|2024年04月24日|
|[[./2024-1-20/5e84f53a0e-DONE.html][ivy-read function                                                               ]]|2024年01月20日|
|[[./2024-1-17/f769507c1e-DONE.html][做一个专注点，C-x w标记当前位置为专注点, C-x C-w返回专注点                                            ]]|2024年01月17日|
* git
|[[./2024-3-7/08c9bf980b-STDY.html][git format-patch部分选项功能说明                                                        ]]|2024年03月07日|
* libc
|[[./2024-3-22/7a734fd719-STDY.html][glibc库探究                                                                        ]]|2024年03月22日|
* linux
|[[./2024-3-25/7781575475-STDY.html][perf-record学习                                                                   ]]|2024年03月25日|
|[[./2024-3-14/11a943c043-STDY.html][进程间通信---信号                                                                      ]]|2024年03月14日|
|[[./2024-3-8/0977a0092b-STDY.html][workqueue学习                                                                     ]]|2024年03月08日|
|[[./2024-2-19/e5abbef496-DONE.html][clock子系统                                                                        ]]|2024年02月19日|
|[[./2024-2-2/5b5416a50a-TODO.html][reset singal device tree bindings                                               ]]|2024年02月02日|
|[[./2024-1-24/517497bb23-STDY.html][ffs & fls & __ffs & __fls                                                       ]]|2024年01月24日|
|[[./2024-1-22/bb5256ac83-RECD.html][驱动BUG总结                                                                         ]]|2024年01月22日|
|[[./2024-1-20/d7ad64af74-TODO.html][IRQ总结                                                                           ]]|2024年01月20日|
|[[./2024-1-19/d9669e4397-RECD.html][64bit系统中32位寄存器映射                                                                ]]|2024年01月19日|
|[[./2024-1-18/861b7e9838-STDY.html][自定义设备树节点属性                                                                      ]]|2024年01月18日|
|[[./2024-1-18/2259f59c19-RECD.html][pdev->id                                                                        ]]|2024年01月18日|
|[[./2024-1-16/d630604437-TODO.html][linux抢占                                                                         ]]|2024年01月16日|
|[[./2024-1-16/d58a67a237-STDY.html][spin_lock & spin_lock_irq & spin_lock_irqsave区别                                 ]]|2024年01月16日|
* mail
|[[./2024-3-7/08c9bf980b-STDY.html][git format-patch部分选项功能说明                                                        ]]|2024年03月07日|
* micropython
|[[./2024-5-21/93579856c8-TODO.html][python async def                                                                ]]|2024年05月21日|
* perf
|[[./2024-3-25/7781575475-STDY.html][perf-record学习                                                                   ]]|2024年03月25日|
* python
|[[./2024-4-29/e1e3cddb89-RECD.html][文件同时可被bash和C使用                                                                  ]]|2024年04月29日|
|[[./2024-3-29/d67c092dd0-DONE.html][Call function directly in cmd line                                              ]]|2024年03月29日|
|[[./2024-2-4/d42736ec4d-STDY.html][python 学习                                                                       ]]|2024年02月04日|
* wsl
|[[./2024-4-18/4c8fed2e7c-RECD.html][wsl export and import issues                                                    ]]|2024年04月18日|
|[[./2024-4-16/64f63e77dd-RECD.html][shared with windows clipboard and screenshot                                    ]]|2024年04月16日|
|[[./2024-4-10/10beed6b18-RECD.html][wsl未注册类                                                                         ]]|2024年04月10日|
