note.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>欢迎来到我的博客</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="./css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="./css/mycustom.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">欢迎来到我的博客</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge7b6ef8">1. busybox</a></li>
<li><a href="#org2f9fdc7">2. cc</a></li>
<li><a href="#orga061351">3. elisp</a></li>
<li><a href="#orgb6f6359">4. git</a></li>
<li><a href="#org416f14c">5. libc</a></li>
<li><a href="#org5b673d7">6. linux</a></li>
<li><a href="#org7c14beb">7. mail</a></li>
<li><a href="#org225759c">8. micropython</a></li>
<li><a href="#orgad48322">9. perf</a></li>
<li><a href="#org59fa613">10. python</a></li>
<li><a href="#orga073d7f">11. wsl</a></li>
<li><a href="#org9184193">12. others</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge7b6ef8" class="outline-2">
<h2 id="orge7b6ef8"><span class="section-number-2">1.</span> busybox</h2>
<div class="outline-text-2" id="text-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-4-11/4607f8e230-RECD.html">busybox /bin/sh: can't access tty; job control turned off                       </a></td>
<td class="org-left">2024年04月11日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2f9fdc7" class="outline-2">
<h2 id="org2f9fdc7"><span class="section-number-2">2.</span> cc</h2>
<div class="outline-text-2" id="text-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-4-29/e1e3cddb89-RECD.html">文件同时可被bash和C使用                                                                  </a></td>
<td class="org-left">2024年04月29日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-18/6d537c26fc-RECD.html">宏里面无法直接使用sizeof                                                                 </a></td>
<td class="org-left">2024年01月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-16/31f55c452f-STDY.html">C语言别名 &amp; 数组指针降级 &amp; 宏#和##                                                          </a></td>
<td class="org-left">2024年01月16日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga061351" class="outline-2">
<h2 id="orga061351"><span class="section-number-2">3.</span> elisp</h2>
<div class="outline-text-2" id="text-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-4-24/fe01846929-RECD.html">auto-fill-mode可以设置每行字长                                                          </a></td>
<td class="org-left">2024年04月24日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-20/5e84f53a0e-DONE.html">ivy-read function                                                               </a></td>
<td class="org-left">2024年01月20日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-17/f769507c1e-DONE.html">做一个专注点，C-x w标记当前位置为专注点, C-x C-w返回专注点                                            </a></td>
<td class="org-left">2024年01月17日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb6f6359" class="outline-2">
<h2 id="orgb6f6359"><span class="section-number-2">4.</span> git</h2>
<div class="outline-text-2" id="text-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-3-7/08c9bf980b-STDY.html">git format-patch部分选项功能说明                                                        </a></td>
<td class="org-left">2024年03月07日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org416f14c" class="outline-2">
<h2 id="org416f14c"><span class="section-number-2">5.</span> libc</h2>
<div class="outline-text-2" id="text-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-3-22/7a734fd719-STDY.html">glibc库探究                                                                        </a></td>
<td class="org-left">2024年03月22日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5b673d7" class="outline-2">
<h2 id="org5b673d7"><span class="section-number-2">6.</span> linux</h2>
<div class="outline-text-2" id="text-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-3-25/7781575475-STDY.html">perf-record学习                                                                   </a></td>
<td class="org-left">2024年03月25日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-3-14/11a943c043-STDY.html">进程间通信---信号                                                                      </a></td>
<td class="org-left">2024年03月14日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-3-8/0977a0092b-STDY.html">workqueue学习                                                                     </a></td>
<td class="org-left">2024年03月08日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-2-19/e5abbef496-DONE.html">clock子系统                                                                        </a></td>
<td class="org-left">2024年02月19日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-2-2/5b5416a50a-TODO.html">reset singal device tree bindings                                               </a></td>
<td class="org-left">2024年02月02日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-24/517497bb23-STDY.html">ffs &amp; fls &amp; __ffs &amp; __fls                                                       </a></td>
<td class="org-left">2024年01月24日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-22/bb5256ac83-RECD.html">驱动BUG总结                                                                         </a></td>
<td class="org-left">2024年01月22日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-20/d7ad64af74-TODO.html">IRQ总结                                                                           </a></td>
<td class="org-left">2024年01月20日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-19/d9669e4397-RECD.html">64bit系统中32位寄存器映射                                                                </a></td>
<td class="org-left">2024年01月19日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-18/861b7e9838-STDY.html">自定义设备树节点属性                                                                      </a></td>
<td class="org-left">2024年01月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-18/2259f59c19-RECD.html">pdev-&gt;id                                                                        </a></td>
<td class="org-left">2024年01月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-16/d630604437-TODO.html">linux抢占                                                                         </a></td>
<td class="org-left">2024年01月16日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-16/d58a67a237-STDY.html">spin_lock &amp; spin_lock_irq &amp; spin_lock_irqsave区别                                 </a></td>
<td class="org-left">2024年01月16日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7c14beb" class="outline-2">
<h2 id="org7c14beb"><span class="section-number-2">7.</span> mail</h2>
<div class="outline-text-2" id="text-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-3-7/08c9bf980b-STDY.html">git format-patch部分选项功能说明                                                        </a></td>
<td class="org-left">2024年03月07日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org225759c" class="outline-2">
<h2 id="org225759c"><span class="section-number-2">8.</span> micropython</h2>
<div class="outline-text-2" id="text-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-5-21/93579856c8-TODO.html">python async def                                                                </a></td>
<td class="org-left">2024年05月21日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgad48322" class="outline-2">
<h2 id="orgad48322"><span class="section-number-2">9.</span> perf</h2>
<div class="outline-text-2" id="text-9">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-3-25/7781575475-STDY.html">perf-record学习                                                                   </a></td>
<td class="org-left">2024年03月25日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org59fa613" class="outline-2">
<h2 id="org59fa613"><span class="section-number-2">10.</span> python</h2>
<div class="outline-text-2" id="text-10">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-4-29/e1e3cddb89-RECD.html">文件同时可被bash和C使用                                                                  </a></td>
<td class="org-left">2024年04月29日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-3-29/d67c092dd0-DONE.html">Call function directly in cmd line                                              </a></td>
<td class="org-left">2024年03月29日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-2-4/d42736ec4d-STDY.html">python 学习                                                                       </a></td>
<td class="org-left">2024年02月04日</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga073d7f" class="outline-2">
<h2 id="orga073d7f"><span class="section-number-2">11.</span> wsl</h2>
<div class="outline-text-2" id="text-11">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-4-18/4c8fed2e7c-RECD.html">wsl export and import issues                                                    </a></td>
<td class="org-left">2024年04月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-4-16/64f63e77dd-RECD.html">shared with windows clipboard and screenshot                                    </a></td>
<td class="org-left">2024年04月16日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-4-10/10beed6b18-RECD.html">wsl未注册类                                                                         </a></td>
<td class="org-left">2024年04月10日</td>
</tr>
</tbody>
</table>
</div>
</div>
