note.html
<div id="outline-container-org9184193" class="outline-2">
<h2 id="org9184193"><span class="section-number-2">12.</span> others</h2>
<div class="outline-text-2" id="text-12">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./2024-5-22/7e74f59268-RECD.html">blog 方案                                                                         </a></td>
<td class="org-left">2024年05月22日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-12/f01d530ba5-RECD.html">format/event/cpumask中struct attribute*数字以NULL结尾                                 </a></td>
<td class="org-left">2024年01月12日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-12/6884b2da75-RECD.html">驱动MMIO操作细节                                                                      </a></td>
<td class="org-left">2024年01月12日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-11/11cb435382-STDY.html">device IO mapping操作                                                             </a></td>
<td class="org-left">2024年01月11日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-10/d4d7be2464-STDY.html">位域操作                                                                            </a></td>
<td class="org-left">2024年01月10日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-10/51286c3ee0-STDY.html">void*指针+1                                                                       </a></td>
<td class="org-left">2024年01月10日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-10/c0e6b03a7a-DONE.html">pr_err和dev_err的区别                                                               </a></td>
<td class="org-left">2024年01月10日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-10/d660577af2-STDY.html">devm_xxx设备资源管理                                                                  </a></td>
<td class="org-left">2024年01月10日</td>
</tr>

<tr>
<td class="org-left"><a href="./2024-1-8/1112901c4d-TODO.html">global-&gt;gtags大量后台进程导致卡死                                                         </a></td>
<td class="org-left">2024年01月08日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-21/09b2e39c93-STDY.html">perf工具-a用法                                                                      </a></td>
<td class="org-left">2023年12月21日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-19/d656f61fce-STDY.html">workqueue工作队列                                                                   </a></td>
<td class="org-left">2023年12月19日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-18/a39e0a172b-STDY.html">busybox/mdev学习                                                                  </a></td>
<td class="org-left">2023年12月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-18/164db53ad1-STDY.html">linux insmod报错问题探究                                                              </a></td>
<td class="org-left">2023年12月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-18/887909460d-STDY.html">跑SMMU中断问题                                                                       </a></td>
<td class="org-left">2023年12月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-7/56198c45a5-STDY.html">mtdnand                                                                         </a></td>
<td class="org-left">2023年12月07日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-6/aa6631199a-STDY.html">gcc编译选项mcmodel=medium                                                           </a></td>
<td class="org-left">2023年12月06日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-5/cc7617c356-CANCELED.html">C-mode实现宏判断                                                                     </a></td>
<td class="org-left">2023年12月05日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-12-1/8ccc65a748-STDY.html">Cache翻译Documentation/admin-guide/device-mapper/cache.rst                        </a></td>
<td class="org-left">2023年12月01日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-22/810bac682c-STDY.html">IOMMU.txt翻译学习，设备树属性层面                                                           </a></td>
<td class="org-left">2023年11月22日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-20/58b9833a46-STDY.html">tty源码探究                                                                         </a></td>
<td class="org-left">2023年11月20日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-20/20d45a10e9-STDY.html">回车与换行的区别                                                                        </a></td>
<td class="org-left">2023年11月20日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-17/1d12211c12-STDY.html">TTY文档翻译                                                                         </a></td>
<td class="org-left">2023年11月17日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-6/706f2a7431-STDY.html">串口方式传送OS binary到DSRAM问题分析                                                       </a></td>
<td class="org-left">2023年11月06日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-3/e82f84e04f-STDY.html">u-boot::pinctrl                                                                 </a></td>
<td class="org-left">2023年11月03日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-11-1/dfb2e9f41b-STDY.html">u-boot学习                                                                        </a></td>
<td class="org-left">2023年11月01日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-27/517f849de0-STDY.html">提交补丁到社区的方法                                                                      </a></td>
<td class="org-left">2023年10月27日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-27/a3adc8f4b3-STDY.html">Kernel/Documentations/doc-guide/kernel-doc.rst翻译                                </a></td>
<td class="org-left">2023年10月27日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-25/3e37be6130-STDY.html">-finstrument-functions                                                          </a></td>
<td class="org-left">2023年10月25日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-24/18e21971ab-STDY.html">mmap系统调用回溯                                                                      </a></td>
<td class="org-left">2023年10月24日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-24/cddb39bd48-STDY.html">ringbuffer aux                                                                  </a></td>
<td class="org-left">2023年10月24日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-18/d45967f391-STDY.html">ringbuffer学习                                                                    </a></td>
<td class="org-left">2023年10月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-16/2d858f2f90-DONE.html">event list                                                                      </a></td>
<td class="org-left">2023年10月16日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-13/471d156f64-STDY.html">使用BHT进行分支预测 翻译                                                                  </a></td>
<td class="org-left">2023年10月13日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-11/93818c5d29-DONE.html">checklist                                                                       </a></td>
<td class="org-left">2023年10月11日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-11/ddd241836e-STDY.html">如何实现分时采样                                                                        </a></td>
<td class="org-left">2023年10月11日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-10/3d45f64c4b-STDY.html">Perf_event_exec(void)                                                           </a></td>
<td class="org-left">2023年10月10日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-10/660d5176e3-STDY.html">Power8 CACHE                                                                    </a></td>
<td class="org-left">2023年10月10日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-8/5dbc6c6838-STDY.html">Linux性能优化--Tuned特性原理及使用指南                                                       </a></td>
<td class="org-left">2023年10月08日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-10-8/9507716c42-STDY.html">高精度事件定时器                                                                        </a></td>
<td class="org-left">2023年10月08日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-27/2a09fa83bd-STDY.html">devicetree                                                                      </a></td>
<td class="org-left">2023年09月27日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-25/a09d109529-STDY.html">/sys/bus/event_source 目录下devices/有内容, drivers/没有驱动                              </a></td>
<td class="org-left">2023年09月25日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-22/2fd7c0c249-STDY.html">pmu-&gt;type                                                                       </a></td>
<td class="org-left">2023年09月22日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-22/2ec691b423-STDY.html">Overflow handling                                                               </a></td>
<td class="org-left">2023年09月22日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-21/cdcf1fd0a8-STDY.html">用户层对采集类型的处理,以及采集内容都可以是啥                                                         </a></td>
<td class="org-left">2023年09月21日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-19/ee98557e7d-STDY.html">理清bus/device_driver/device之间的关系                                                 </a></td>
<td class="org-left">2023年09月19日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-18/f9867fb17a-STDY.html">linux-6.5版本编译perf命令                                                             </a></td>
<td class="org-left">2023年09月18日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-15/cc96be43a4-STDY.html">如何统计cpu在某个状态驻留的时间                                                               </a></td>
<td class="org-left">2023年09月15日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-8/489ffd4a40-STDY.html">学习cpu_hotplug                                                                   </a></td>
<td class="org-left">2023年09月08日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-7/78fbb3d99c-STDY.html">学习kbuild                                                                        </a></td>
<td class="org-left">2023年09月07日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-5/f7c76da9cf-STDY.html">学习设备树格式及其生成使用原理                                                                 </a></td>
<td class="org-left">2023年09月05日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-9-1/3102704bc9-DEBG.html">PowerPC 架构学习以及处理器idle相关内容学习                                                     </a></td>
<td class="org-left">2023年09月01日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-8-31/bb0dd09c9f-DEBG.html">解决启动问题 can't access tty job control turned off                                  </a></td>
<td class="org-left">2023年08月31日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-8-30/57a7184543-STDY.html">epapr 的生成及其初始运行                                                                 </a></td>
<td class="org-left">2023年08月30日</td>
</tr>

<tr>
<td class="org-left"><a href="./2023-8-29/614a00c829-STDY.html">学习rootfs相关内容并理解多种方式加载的区别                                                        </a></td>
<td class="org-left">2023年08月29日</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
